Configuration/3D/M1/Allrun
#!/bin/sh

# create input file from 1D computation for funkySetFields
mkdir 1d_profil
python3 -c "import fluidfoam; fluidfoam.create1dprofil('1D', '.', '1000', 'Y', ['U.a', 'U.b', 'alpha.a', 'k.b', 'p_rbgh', 'omega.b', 'Theta'])"

# create the mesh
blockMesh

# renumber the mesh
renumberMesh -overwrite -constant

# check the mesh
checkMesh # -allTopology -allGeometry -constant

# create the intial time folder
cp -r 0_org 0

# Initialize the alpha field
funkySetFields -time 0

# Decompose the case in order to run in parallel (on 4 cores)
decomposePar

# Run sedFoam in parallel
mpirun -np 10 sedFoam_rbgh -parallel > log&
