Configuration/3D/M1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          5e-4;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression false;

timeFormat      general;

timePrecision   8;

runTimeModifiable on;

adjustTimeStep  false;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       5e-4;

favreAveraging false;

libs (
"libturbulenceModels.so"
"libgroovyBC.so"
"libgroovyStandardBCs.so"
"libtwoPhaseTurbulenceModels.so"
     );

functions 
{  
    #include "forceCoeffs"
    Multiply
    {
    type            multiply;
    libs            (fieldFunctionObjects);
    fields          (alpha.a U.a);
    result          alphaUa;
    executeControl  timeStep;
    writeControl    writeTime;
    }
    fieldAverage
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        restartOnrestart false;
	periodicRestart     true;
    	restartPeriod       0.25;
        fields
        (
	    U.a
            {
               mean         on;
               prime2Mean   off;
               base         time;
            }
	    alpha.a
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
	    alphaUa
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
    }
}


// ************************************************************************* //
